export const state = () => ({
  articles: [
    {
      id: '01',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-01.png',
      title: '5 причин начать изучать историю семьи',
      date: '21.06.2022',
      url: '',
      desc: 'К исследованию своей родословной люди приходят в разном возрасте и по разным причинам. Кого-то ещё с детства мучает любопытство, а кто-то, став уже взрослым и успешным человеком, осознаёт острую необходимость знать, кем были его предки. Причин возникновения интереса к своей родословной - огромное множество. Расскажем о пяти распространённых причинах.<br><br><ul style="margin-left: 25px;"><li>Рождение детей. Нередко именно с рождением детей человек начинает понимать, что такое преемственность поколений. Что останется от него после того, как он покинет этот мир? И тогда он начинает искать способ сохранить для потомков память о себе, своих родителях, бабушках и дедушках и всех тех, кто стоит за его плечами.<br><br></li><li>Понимание того, кем были предки, чем они занимались веками, какие ценности разделяли, дают хороший шанс получить ответ на вопрос: «Кто я такой?», «Что после меня останется потомкам?».<br><br></li><li>Поиск пропавших без вести, военный поиск. Часто бывает так, что связь с родственником надолго пропадает. Тогда один из членов семьи начинает собирать все «зацепки», ведущие к нему. Нередко этот по-настоящему детективный поиск приводит к успеху.<br><br></li><li>Интерес к судьбе родственников, не вернувшихся с войны, желание отдать должное людям, подарившим нам мирное небо над головой, тоже - одна из частых причин начала генеалогического поиска.<br><br></li><li>Смерть близкого человека. К сожалению, иногда мы начинаем осознавать преемственность поколений, только когда близкие уходят. После них остаётся много вещей - фотографий, письма, дневники. Изучение домашнего архива иногда рождает неподдельный интерес. Кто эти люди, изображённые на фотографиях? И какую роль они сыграли в жизни моей семьи</li></ul>'
    },
    {
      id: '02',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-02.png',
      title: 'Самое большое в истории генеалогическое древо',
      date: '28.06.2022',
      url: '',
      desc: 'Используя миллионы записей с сайта генеалогии, генетики создали самую большую в мире родословную. Она соединяет около 13 миллионов человек, в основном из Европы и Северной Америки, и уходит на столетия в прошлое.<br><br>Джоанна Капланис из Нью-Йорского геномного центра проанализировали 86 миллионов зарегистрированных профилей людей. Ученые изучили данные о рождении, браке и смерти более одиннадцати поколений, чтобы найти единого для всех 13 миллионов человек предка, родословную надо было ""отмотать"" назад примерно на 65 поколений, сообщается в журнале.<br><br>Гигантское генеалогическое древо включает истории людей, живших в самых разных уголках Земли: в США, в Канаде, в странах Европы, в ЮАР и на территории Австралии и Новой Зеландии.<br><br>Древо раскрывает и некоторые секреты личной жизни людей прошлого, ""кто и где находил свою любовь"". Например, на основании многочисленных дат и мест рождения, брака и смерти было определено, что ""в 1700 году люди вступали в брак с кузенами и кузинами, родившимися в радиусе 10 километров; примерно с 1850 года они женились на менее генетически связанных друг с другом партнерах"". В 1950 году расстояние между потенциальными супругами было уже около 100 километров.<br><br>Данные также показали, что за последние 300 лет значительно чаще из-за любви меняли место жительства женщины, чем мужчины.<br><br>Кроме этого, были дополнительно изучены данные трех миллионов родственников, родившихся между 1600 и 1910 годами и старше 30 лет. У ученых была цель - выяснить, какую роль играют гены в долголетии. До сих пор предполагалось, что гены в 15-30% отвечают за продолжительность жизни. Анализ показал: их влияние - всего лишь 16%. Таким образом, хорошие гены продлевают жизнь в среднем на пять лет.'
    },
    {
      id: '03',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-03.png',
      title: 'Виды родословного древа',
      date: '07.07.2022',
      url: '',
      desc: 'Все знают самый распространенный классический вариант:<br><br>ветвящаяся схема, которая дополняется рисунком дерева.<br><br>Мы тоже, чаще всего, используем такую схему в своих работах, потому что она подходит для оформления даже самых сложных генеалогических линий!<br><br>Бывают случаи довольно глубоких и непростых раскопок – мы находили предков заказчика вплоть до 18 века!<br><br>Но есть и другие способы визуализации.<br><br>Все зависит от того, кто в роду послужит отправной точкой.<br><br>Вариант 1: нарисовать восходящее родовое дерево для вашего ребенка, где он сам и будет точкой отсчета - схема «веер».<br><br>Вариант 2: сделать прекрасный подарок для дальнего родственника - изобразить на схеме в качестве начальной фигуры общего предка и от него построить нисходящую систему связей всех двоюродных и троюродных братьев и сестер.<br><br>Вариант 3: оформить схему в виде «песочных часов».<br><br>Такой вариант подойдет для подарка старшим родственникам: дедам или прадедам.<br><br>Берем их в качестве ключевых фигур и совмещаем на рисунке нисходящие и восходящие схемы – родителей и потомков.<br><br>Вариант 4: Составляем схему «бабочка».<br><br>Это близко к варианту «часы», но здесь исходной точкой будут супруги, а по обеим сторонам от них восходящие родовые древа их родителей, а внизу - нисходящее'
    },
    {
      id: '04',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-04.png',
      title: 'Почему не всегда получается найти самостоятельно',
      date: '14.07.2022',
      url: '',
      desc: 'Совсем недавно у нас был как раз такой случай. К нам обратилась девушка, которая очень долго пыталась сама составить свое родословное древо: отправляла запросы, ходила в национальный архив, но все равно не могла найти довольно большой пласт данных.<br><br>И только когда мы уже презентовали ей готовую работу, она поняла, в чем же была проблема. Оказалось, что на протяжении нескольких поколений, у ее предков менялась фамилия. Она об этом не знала и даже не рассматривала такой вариант - в итоге подавала запросы с неверными данными на несуществующих людей.<br><br>Вот такой показательный случай. Поэтому мы всегда говорим: готовых ответов во время поиска семейных  корней не бывает. Только команда специалистов - историков, архивоведов, филологов - может действительно правильно и до конца трактовать все найденные данные и составить их в единую цепочку.'
    },
    {
      id: '05',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-05.png',
      title: '8 особенностей, которые передаются нам генетически',
      date: '22.07.2022',
      url: '',
      desc: '1. Характер сна<br><br>Гиперсомния (повышенная сонливость днем), бессонница или парасомнии (различные расстройства сна) заложены у нас в генах.<br><br>2. Долголетие<br><br>Ученые давно изучают долгожителей в попытке определить, что же влияет на продолжительность жизни в большей мере. Результаты разных исследований показали, что у таких людей мало общего в образовании, доходе или профессии. Однако у них все же есть схожие черты. Многие из них не курят, не страдают от ожирения и хорошо справляются со стрессом. Кроме того, большинство из них - женщины.<br><br>Также известно, что братья и сестры долгожителей обычно тоже живут дольше, даже если ведут менее здоровый образ жизни.<br><br>3. Предрасположенность к полноте<br><br>Индекс массы тела (ИМТ) человека во многом зависит от его генов. В этом вопросе также нельзя отрицать влияние среды, но ученые убеждены, что до 70 % различий между жировой массой разных людей сводится к их ДНК.<br><br>4. Агрессия<br><br>Новейшие исследования говорят, что, возможно, обнаруженный ген делает человека не более агрессивным или азартным, а более чутким к собственным интересам, что и вынуждает его быть напористым и рисковать. А уже это может восприниматься окружающими как агрессия.<br><br>5. Близорукость<br><br>Исследования, в рамках которых специалисты изучали наследование близорукости в семьях, показали, что это заболевание действительно может передаваться из поколения в поколение. Хотя ученые не отрицают, что близорукость может развиться еще и из-за влияния окружающей среды.<br><br>6. Потливость<br><br>7. Форма мочек ушей<br><br>8. Импульсивность'
    },
    {
      id: '06',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-06.png',
      title: 'Ревизские сказки',
      date: '29.07.2022',
      url: '',
      desc: 'Реви́зские сказки - документы, отражающие результаты проведения подушных переписей податного населения Российской империи в XVIII - 1-й половине XIX веков, проводившихся с целью налогообложения<br><br>Ревизские сказки представляли собой поимённые списки населения, в которых указывались имя, отчество и фамилия (при её наличии) главы семьи, его возраст, имя и отчество членов семьи с указанием возраста, отношение к главе семьи.<br><br>В промежутках между ревизиями ревизские сказки уточнялись. Производилась фиксация наличия или отсутствия лица на момент текущего учёта, причём в случае отсутствия фиксировалась причина (умер, в бегах, отселён, в солдатах и т. п.).<br><br>На сегодняшний день материалы ревизских сказок являются одним из важных источников в генеалогических исследованиях.'
    },
    {
      id: '07',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-07.png',
      title: 'Шежере - это история своего рода',
      date: '10.08.2022',
      url: '',
      desc: 'Это генеалогическая запись башкирских племен и родов, куда вносились имена предводителей родов по мужской линии, включались сведения об исторических событиях, о важнейших фактах жизни родов и племен.<br><br>Знание родовых шежере считалось обязательным. В XV-XVI вв. они получили письменное оформление. Самые ранние записи, возможно, были зафиксированы в булгарский период XII-XV<br><br>Башкирские шежере в известной степени носят энциклопедический характер: в них наряду с историческими сведениями имеются сообщения о быте, нравах народа, юридических и морально-этических нормах, сюжеты произведений народного творчества, литературные фрагменты.<br><br>В настоящее время желающие составить свое шежере обращаются в так называемые ревизские сказки. Может возникнуть резонный вопрос: что это такое? Где их искать? Ревизиями в 18-20 столетиях в России называли переписи податного населения - иными словами, налогоплательщиков.'
    },
    {
      id: '08',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-08.png',
      title: 'История клиента: что можно узнать о своих предках',
      date: '15.08.2022',
      url: '',
      desc: 'Некоторые почему-то думают, что в ходе исследований родословной можно выяснить только какие-нибудь сухие факты: имена, даты жизни, место рождения. Друзья, это совершенно не так!<br><br>Если правильно интерпретировать найденные данные при помощи историков, то можно сделать очень интересные выводы!<br><br>Например, в одном из последних исследований мы обнаружили, что у предков нашей клиентки в 1917 году было много акров земли, 40 голов скота и целых 15 лошадей - семья довольно зажиточная. На этом можно было бы остановиться, но мы обратили внимание, что в подворной карточке этого дома была вписана еще и 20-летная квартирантка с припиской «кумысник».<br><br>Что это значит?<br><br>Наши историки объяснили: в те время люди специально приезжали из городов в деревни «подлечиться на кумыс». Отсюда следует, что эта семья занималась кумысоделием и принимала к себе людей «на лечение».<br><br>Вот такие интересные факты!<br><br>Кстати, оказалось, что предки этого же клиента принадлежали еще и к определенному клану, у них был свой родовой фамильный знак «тамга». Такое встречается довольно редко – историки в таких случаях всегда говорят, что это сильный, интересный род, раз даже такие отличия были.'
    },
    {
      id: '09',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-09.png',
      title: '5 известных русских фамилий и их значения',
      date: '22.08.2022',
      url: '',
      desc: 'Когда у нас появляется новый заказ на проработку истории фамилии, я всегда с интересом разглядываю результат. Пользуюсь, так сказать, служебным положением, чтобы расширить кругозор.<br><br>Потому что это действительно интересно - многие фамилии как будто скрывают в себе тайну… а мы живём и даже и не задумываемся, почему нас зовут именно так.<br><br>А сегодня я решила немного подогреть и ваш интерес к своим корням и поделиться значениями нескольких известных фамилий. Может быть, одна из них - ваша? Итак:<br><br>Путин Эта всем известная фамилия происходит от старинных славянских имён Путислав (соединение корней «путь» и «слава») и Путимир («путь» и «мир»). Либо от более поздних сокращений этих имён Путята и даже Путя<br><br>Булгаков Эта фамилия, образована от старинного русского имени Булгак. Либо предки могут быть родом из нескольких сел и деревень с названием Булгак или Булгаковка.<br><br>Тургенев.В дореволюционной России сразу несколько дворянских родов носили эту фамилию. Корень слова - монгольский, и в переводе «турген» означает «быстрый» или «скорый».<br><br>Кузнецов. Считается, что сейчас это самая популярная фамилия не только в России, но и во всем мире Раньше же кузнец был в каждом, даже захолустном местечке. Кстати, англичанин по фамилии Смит или немец Шмидт - это тоже потомки кузнецов.<br><br>Смирнов. Про эту фамилию мне показалось интересным вот что можно подумать, что так называли тихих, спокойных, «смирных» людей. а на самом деле, фамилия пошла от старинного мужского имени «Смирна».'
    },
    {
      id: '10',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-10.png',
      title: 'Полезные ресурсы для поиска своих предков',
      date: '03.09.2022',
      url: '',
      desc: 'Недавно читали историю девушки, которая случайно наткнулась на тетрадку своего деда. Он записывал в нее свои воспоминания и семейные предания Например, как его прадед швырнул в свою младшую дочь ножом, чтобы заставить выйти замуж и избежать скандала, потому, что старшая сестра спряталась от нелюбимого жениха.<br><br>Кажется, что это сюжет какой-нибудь книги или фильма, правда? А на самом деле, это ведь реальные судьбы.<br><br>И у каждого из нас есть свои корни - это такие же живые люди со своими драмами и историями любви. Каждый делал свой выбор и стоил жизнь на свой лад.<br><br>Поэтому мы решили поделиться несколькими полезными ресурсами, на которых можно узнать хотя бы что-то о своих предках:<br><br><ul style="margin-left: 25px;"><li><a style="color: rgba(0, 0, 0, 0.72)!important;" href="http://dvorianstvo.org/ ">http://dvorianstvo.org/ </a> список дворянских родов Российской империи.</li><li><a style="color: rgba(0, 0, 0, 0.72)!important;" href="obd-memorial.ru">obd-memorial.ru</a> банк данных о защитниках Отечества, погибших, умерших и пропавших без вести в период Великой Отечественной войны и послевоенный период.</li><li><a style="color: rgba(0, 0, 0, 0.72)!important;" href="memo.ru">memo.ru</a> общая база данных жертв политических репрессий, сталинские расстрельные списки и т.д.</li></ul><br> Конечно, это только для начала, но зато эти открытые базы данных делают поиск реальным для каждого. В нашем Центре семейной родословнной процесс поиска и составления генеалогического древа уже здорово отработан. Мы можем достаточно быстро собрать и классифицировать большой объем информации чтобы и ваши предки обрели реальные черты, а не только отрывочные воспоминания.'
    },
    {
      id: '11',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-11.png',
      title: 'Как узнать, кто ваш прадед',
      date: '16.10.2022',
      url: '',
      desc: 'Если вы решили составить свою родословную, то для начала нужно от чего-то оттолкнуться, правильно? Например, чтобы мы могли послать запрос в архив, необходимо знать хотя бы про одного предка следующее<br><br>ФИО <br><br><ul style="margin-left: 25px;"><li>дата жизни</li><li>место рождения</li><li>имена родных братьев и сестёр</li></ul><br><br>Но что делать, если у вас вообще нет никаких данных? Искать! <br><br>Вот несколько полезных ресурсов, которые могут помочь: <br><br>1. Форум исследователей родословной - <a  style="color: rgba(0, 0, 0, 0.72)!important;" href="forum.vgd.ru">forum.vgd.ru.</a> Здесь очень много информации! <br><br>2. Старый, забытый сайт с фотографиями и описаниями воинских захоронений - <a style="color: rgba(0, 0, 0, 0.72)!important;" href="pomnite-nas.ru">pomnite-nas.ru</a> <br><br>3. Поисковое движение РФ, где есть имена от солдатских медальонов, алфавитные сведения о погибших в годы войны и т. д. - <a style="color: rgba(0, 0, 0, 0.72)!important;" href="rf-poisk.ru">rf-poisk.ru</a> <br><br>Сохраняйте и пользуйтесь  На первой бесплатной консультации в нашем Центре восстановления родословной расскажем еще больше подробностей.'
    },
    {
      id: '12',
      src: 'https://galinarubleva-drevo.ru/files/img/articles/article-12.png',
      title: 'Кое-что интересное про однофамильцев',
      date: '20.11.2022',
      url: '',
      desc: 'Как-то я рассказывала, что многие фамилии имеют общую географию происхождения - это значит, что по фамилии можно примерно предположить, где жили ваши предки. <br><br> Так вот я столкнулась с мнением исследователей о том, что некоторые однофамильцы могут иметь ещё и ОБЩУЮ предрасположенность к одним и тем же болезням. Такой вывод сделали генетики, когда проанализировали биологические образцы двух с половиной тысяч мужчин. Они вычислили, что среди людей, которые носят одно и то же семейное имя, многие обладают одинаковой гаплогруппой Y-хромосомы то есть принадлежат к одному роду. <br><br> Поэтому учёные называют фамилии «квазигенами», а медики используют метод анализа фамилии для уточнения диагноза. Вот такие интересные факты. <br><br> Мы напоминаем, что у нас есть услуга – «история фамилии», при помощи которой вы можете узнать много важных подробностей о себе и своей семье.'
    }
  ],
  currentArticle: 0,
  shareOpened: false, // окно со ссылками соц сетей
  randomCards: [{
    id: '01',
    src: 'https://galinarubleva-drevo.ru/files/img/articles/article-01.png',
    title: '5 причин начать изучать историю семьи',
    date: '21.06.2022',
    url: '',
    desc: 'К исследованию своей родословной люди приходят в разном возрасте и по разным причинам. Кого-то ещё с детства мучает любопытство, а кто-то, став уже взрослым и успешным человеком, осознаёт острую необходимость знать, кем были его предки. Причин возникновения интереса к своей родословной - огромное множество. Расскажем о пяти распространённых причинах.<br><br><ul style="margin-left: 25px;"><li>Рождение детей. Нередко именно с рождением детей человек начинает понимать, что такое преемственность поколений. Что останется от него после того, как он покинет этот мир? И тогда он начинает искать способ сохранить для потомков память о себе, своих родителях, бабушках и дедушках и всех тех, кто стоит за его плечами.<br><br></li><li>Понимание того, кем были предки, чем они занимались веками, какие ценности разделяли, дают хороший шанс получить ответ на вопрос: «Кто я такой?», «Что после меня останется потомкам?».<br><br></li><li>Поиск пропавших без вести, военный поиск. Часто бывает так, что связь с родственником надолго пропадает. Тогда один из членов семьи начинает собирать все «зацепки», ведущие к нему. Нередко этот по-настоящему детективный поиск приводит к успеху.<br><br></li><li>Интерес к судьбе родственников, не вернувшихся с войны, желание отдать должное людям, подарившим нам мирное небо над головой, тоже - одна из частых причин начала генеалогического поиска.<br><br></li><li>Смерть близкого человека. К сожалению, иногда мы начинаем осознавать преемственность поколений, только когда близкие уходят. После них остаётся много вещей - фотографий, письма, дневники. Изучение домашнего архива иногда рождает неподдельный интерес. Кто эти люди, изображённые на фотографиях? И какую роль они сыграли в жизни моей семьи</li></ul>'
  },
  {
    id: '02',
    src: 'https://galinarubleva-drevo.ru/files/img/articles/article-02.png',
    title: 'Самое большое в истории генеалогическое древо',
    date: '28.06.2022',
    url: '',
    desc: 'Используя миллионы записей с сайта генеалогии, генетики создали самую большую в мире родословную. Она соединяет около 13 миллионов человек, в основном из Европы и Северной Америки, и уходит на столетия в прошлое.<br><br>Джоанна Капланис из Нью-Йорского геномного центра проанализировали 86 миллионов зарегистрированных профилей людей. Ученые изучили данные о рождении, браке и смерти более одиннадцати поколений, чтобы найти единого для всех 13 миллионов человек предка, родословную надо было ""отмотать"" назад примерно на 65 поколений, сообщается в журнале.<br><br>Гигантское генеалогическое древо включает истории людей, живших в самых разных уголках Земли: в США, в Канаде, в странах Европы, в ЮАР и на территории Австралии и Новой Зеландии.<br><br>Древо раскрывает и некоторые секреты личной жизни людей прошлого, ""кто и где находил свою любовь"". Например, на основании многочисленных дат и мест рождения, брака и смерти было определено, что ""в 1700 году люди вступали в брак с кузенами и кузинами, родившимися в радиусе 10 километров; примерно с 1850 года они женились на менее генетически связанных друг с другом партнерах"". В 1950 году расстояние между потенциальными супругами было уже около 100 километров.<br><br>Данные также показали, что за последние 300 лет значительно чаще из-за любви меняли место жительства женщины, чем мужчины.<br><br>Кроме этого, были дополнительно изучены данные трех миллионов родственников, родившихся между 1600 и 1910 годами и старше 30 лет. У ученых была цель - выяснить, какую роль играют гены в долголетии. До сих пор предполагалось, что гены в 15-30% отвечают за продолжительность жизни. Анализ показал: их влияние - всего лишь 16%. Таким образом, хорошие гены продлевают жизнь в среднем на пять лет.'
  }]
})

export const getters = {
  getCurrentArticle (state) {
    return state.articles.slice().reverse()[state.currentArticle]
  },
  getArticleTitles (state) {
    const articles = []
    for (let i = 0; i < state.articles.length; i++) {
      articles.push(state.articles[i].title)
    }
    return articles.reverse()
  },
  getAllArticles (state) {
    const arr = state.articles.slice().reverse()
    return arr
  },
  getShareBtnStatus (state) {
    return state.shareOpened
  },
  getRandomCards (state) {
    return state.randomCards
  }
}
export const mutations = {
  setCurrentArticle (state, payload) {
    state.currentArticle = payload.value
  },
  toggleLinks (state) {
    state.shareOpened = !state.shareOpened
  },
  closeLinks (state) {
    state.shareOpened = false
  },
  setRandomCards (state) {
    const lengthArr = state.articles.length
    const rndNum1 = Math.floor(Math.random() * lengthArr)
    let rndNum2
    if (lengthArr > 1) {
      do {
        rndNum2 = Math.floor(Math.random() * lengthArr)
      } while (rndNum1 === rndNum2)
    }
    state.randomCards = [state.articles[rndNum1], state.articles[rndNum2]]
  },
  setUrl (state) {
    const articles = state.articles
    const a = {}
    a[':'] = ''
    a[' '] = '-'
    a['—'] = '-'
    a['Ё'] = 'YO'
    a['Й'] = 'I'
    a['Ц'] = 'TS'
    a['У'] = 'U'
    a['К'] = 'K'
    a['Е'] = 'E'
    a['Н'] = 'N'
    a['Г'] = 'G'
    a['Ш'] = 'SH'
    a['Щ'] = 'SCH'
    a['З'] = 'Z'
    a['Х'] = 'H'
    a['Ъ'] = ''
    a['ё'] = 'yo'
    a['й'] = 'i'
    a['ц'] = 'ts'
    a['у'] = 'u'
    a['к'] = 'k'
    a['е'] = 'e'
    a['н'] = 'n'
    a['г'] = 'g'
    a['ш'] = 'sh'
    a['щ'] = 'sch'
    a['з'] = 'z'
    a['х'] = 'h'
    a['ъ'] = ''
    a['Ф'] = 'F'
    a['Ы'] = 'I'
    a['В'] = 'V'
    a['А'] = 'a'
    a['П'] = 'P'
    a['Р'] = 'R'
    a['О'] = 'O'
    a['Л'] = 'L'
    a['Д'] = 'D'
    a['Ж'] = 'ZH'
    a['Э'] = 'E'
    a['ф'] = 'f'
    a['ы'] = 'i'
    a['в'] = 'v'
    a['а'] = 'a'
    a['п'] = 'p'
    a['р'] = 'r'
    a['о'] = 'o'
    a['л'] = 'l'
    a['д'] = 'd'
    a['ж'] = 'zh'
    a['э'] = 'e'
    a['Я'] = 'Ya'
    a['Ч'] = 'CH'
    a['С'] = 'S'
    a['М'] = 'M'
    a['И'] = 'I'
    a['Т'] = 'T'
    a['Ь'] = ''
    a['Б'] = 'B'
    a['Ю'] = 'YU'
    a['я'] = 'ya'
    a['ч'] = 'ch'
    a['с'] = 's'
    a['м'] = 'm'
    a['и'] = 'i'
    a['т'] = 't'
    a['ь'] = ''
    a['б'] = 'b'
    a['ю'] = 'yu'

    articles.forEach((article) => {
      let answer = '/articles/'
      for (let i = 0; i < article.title.length; ++i) {
        answer += a[article.title[i]] === undefined ? article.title[i] : a[article.title[i]]
      }
      article.url = answer
    })
  }
}
