export const state = () => ({
  currentPackageNum: 1,
  packages: [
    {
      id: '01',
      src: 'http://galinarubleva-drevo.ru/files/img/service_packages/rb_eco.png',
      title: 'Эконом по РБ',
      url: '/packages/rb/econom',
      desc: 'Составление родословного древа по прямой мужской линии до конца 18 века <br><br> Поиск документов об участии персон в Первой мировой и Великой отечественной войнах<br><br> Поиск, копирование, чтение фотокопий метрич. книг нач. XX в. и перевод нужных записей<br><br> Поиск и обработка сведений о хозяйстве по состоянию<br> на 1917 или 1920 год (по переписи)<br><br> Составление схемы родословной линии и пояснительной записки<br><br> Поиск в органах ЗАГС Башкирии за советский период с 1920-х гг. записей<br> о рождении единокровной родни и прочих актовых записей (в среднем 5 записей)',
      price: '40000',
      oldprice: '45000'
    },
    {
      id: '02',
      src: 'http://galinarubleva-drevo.ru/files/img/service_packages/rb_std.png',
      title: 'Стандарт по РБ',
      url: '/packages/rb/standart',
      desc: 'Составление родословного древа по прямой мужской линии до конца 18 века<br><br>Поиск документов об участии персон в Первой мировой и Великой отечественной войнах<br><br>Поиск, копирование, чтение фотокопий метрич. книг нач. XX в. и перевод нужных записей<br><br>Поиск и обработка сведений о хозяйстве по состоянию на 1917 или 1920 год (по переписи)<br><br>Составление схемы родословной линии и пояснительной записки<br><br>Поиск доп. информации о предках в исторических сборниках, современных книгах о дворянах и краеведческих книгах (с обнаружением минимум в 1 наименов. литературы)<br><br>Поиск в органах ЗАГС Башкирии за советский период с 1920-х гг. записей о рождении единокровной родни и прочих актовых записей (в среднем 5 записей)<br><br>Дизайн и оформление на специальной бумаге всех документов<br><br>Презентация исследовательской работы в офисе',
      price: '70000',
      oldprice: '75000'
    },
    {
      id: '03',
      src: 'http://galinarubleva-drevo.ru/files/img/service_packages/rb_vip.png',
      title: 'VIP по РБ',
      url: '/packages/rb/vip',
      desc: 'Составление родословного древа по прямой мужской линии до конца 18 века<br><br>Поиск документов об участии персон в Первой мировой и Великой отечественной войнах<br><br>Поиск, копирование, чтение фотокопий метрич. книг нач. XX в. и перевод нужных записей<br><br>Поиск и обработка сведений о хозяйстве по состоянию на 1917 или 1920 год (по переписи)<br><br>Составление схемы родословной линии и пояснительной записки<br><br>Поиск доп. информации о предках в исторических сборниках, современных книгах о дворянах и краеведческих книгах (с обнаружением минимум в 1 наименов. литературы)<br><br>Поиск в органах ЗАГС Башкирии за советский период с 1920-х гг. записей о рождении единокровной родни и прочих актовых записей (в среднем 5 записей)<br><br>Составление родословного древа по прямой и боковым мужским линиям до 17 века<br><br>Поиск доп. информации о предках в исторических сборниках, современных книгах о дворянах и краеведческих книгах (с обнаружением минимум в 3 наименов. литературы)<br><br>Поиск сведений в делах о лишенцах в Нацархиве РБ и копирование нужных записей<br><br>Дизайн и оформление на специальной бумаге всех документов',
      price: '110000',
      oldprice: '115000',
      viptext:
        'Презентация исследовательской работы в офисе<br><br> Презентация исследовательской работы с выездом на мероприятие, на дом *(по Уфе)<br><br> Родословная книга (из трех на выбор)'
    },
    {
      id: '04',
      src: 'http://galinarubleva-drevo.ru/files/img/service_packages/rb_eco.png',
      title: 'Эконом по РФ',
      url: '/packages/rf/econom',
      desc: 'Составление родословного древа по прямой мужской линии до конца 18 века <br><br> Поиск документов об участии персон в Первой мировой и Великой отечественной войнах<br><br> Поиск, копирование, чтение фотокопий метрич. книг нач. XX в. и перевод нужных записей<br><br> Поиск и обработка сведений о хозяйстве по состоянию<br> на 1917 или 1920 год (по переписи)<br><br> Составление схемы родословной линии и пояснительной записки<br><br> Поиск в органах ЗАГС Башкирии за советский период с 1920-х гг. записей<br> о рождении единокровной родни и прочих актовых записей (в среднем 5 записей)',
      price: '135000',
      oldprice: '140000'
    },
    {
      id: '05',
      src: 'http://galinarubleva-drevo.ru/files/img/service_packages/rb_std.png',
      title: 'Стандарт по РФ',
      url: '/packages/rf/standart',
      desc: 'Составление родословного древа по прямой мужской линии до конца 18 века<br><br>Поиск документов об участии персон в Первой мировой и Великой отечественной войнах<br><br>Поиск, копирование, чтение фотокопий метрич. книг нач. XX в. и перевод нужных записей<br><br>Поиск и обработка сведений о хозяйстве по состоянию на 1917 или 1920 год (по переписи)<br><br>Составление схемы родословной линии и пояснительной записки<br><br>Поиск доп. информации о предках в исторических сборниках, современных книгах о дворянах и краеведческих книгах (с обнаружением минимум в 1 наименов. литературы)<br><br>Поиск в органах ЗАГС Башкирии за советский период с 1920-х гг. записей о рождении единокровной родни и прочих актовых записей (в среднем 5 записей)<br><br>Дизайн и оформление на специальной бумаге всех документов<br><br>Презентация исследовательской работы в офисе',
      price: '165000',
      oldprice: '170000'
    },
    {
      id: '06',
      src: 'http://galinarubleva-drevo.ru/files/img/service_packages/rb_vip.png',
      title: 'VIP по РФ',
      url: '/packages/rf/vip',
      desc: 'Составление родословного древа по прямой мужской линии до конца 18 века<br><br>Поиск документов об участии персон в Первой мировой и Великой отечественной войнах<br><br>Поиск, копирование, чтение фотокопий метрич. книг нач. XX в. и перевод нужных записей<br><br>Поиск и обработка сведений о хозяйстве по состоянию на 1917 или 1920 год (по переписи)<br><br>Составление схемы родословной линии и пояснительной записки<br><br>Поиск доп. информации о предках в исторических сборниках, современных книгах о дворянах и краеведческих книгах (с обнаружением минимум в 1 наименов. литературы)<br><br>Поиск в органах ЗАГС Башкирии за советский период с 1920-х гг. записей о рождении единокровной родни и прочих актовых записей (в среднем 5 записей)<br><br>Составление родословного древа по прямой и боковым мужским линиям до 17 века<br><br>Поиск доп. информации о предках в исторических сборниках, современных книгах о дворянах и краеведческих книгах (с обнаружением минимум в 3 наименов. литературы)<br><br>Поиск сведений в делах о лишенцах в Нацархиве РБ и копирование нужных записей<br><br>Дизайн и оформление на специальной бумаге всех документов',
      price: '185000',
      oldprice: '190000',
      viptext:
        'Презентация исследовательской работы в офисе/Skype<br><br> Презентация исследовательской работы с выездом на мероприятие, на дом *(по Уфе)<br><br> Родословная книга (из трех на выбор)'
    }
  ]
})

export const getters = {
  getAllPackages (state) {
    return state.packages
  },
  getCurrentPackage (state) {
    return state.packages[state.currentPackageNum]
  },
  getCurrentPackageNum (state) {
    return state.currentPackageNum
  }
}

export const mutations = {
  setCurrentPackage (state, payload) {
    state.currentPackageNum = payload.value
  }
}
